<!DOCTYPE html>
<!--
@(#)import-csv.html 2.13.0 23.03.2017

Copyright (c) 1999-2017 Musiques Tangentes. All Rights Reserved.

This file is part of Algem.
Algem is free software: you can redistribute it and/or modify it
under the terms of the GNU Affero General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

Algem is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
GNU Affero General Public License for more details.

You should have received a copy of the GNU Affero General Public License
along with Algem. If not, see http://www.gnu.org/licenses.

-->
<html>
  <head>
    <title>Import CSV</title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width">
    <link rel="stylesheet" href="help.css" />
  </head>
  <body>
    <h2>Importation de contacts &agrave; partir d'un fichier au format CSV</h2>
    <h3>Informations</h3>
    <p>Ce module vous permet d'importer un ensemble de contacts dans Algem. Il est destin&eacute; en priorit&eacute; aux nouveaux utilisateurs du logiciel afin de leur &eacute;viter de resaisir des informations dont ils disposent d&eacute;j&agrave;.<br />
    Si vous partez d'un fichier Excel, il faut l'enregistrer au format <b>csv</b>, en tenant compte des caract&eacute;ristiques suivantes :
    <ul><li>Le s&eacute;parateur de champs est le caract&egrave;re <b>point-virgule</b>.</li>
    <li>Les champs sont d&eacute;limit&eacute;s par des <b>guillemets</b>.</li>
    <li>Si vous avez la possibilit&eacute; de sp&eacute;cifier l'encodage des caract&egrave;res, choisissez de pr&eacute;f&eacute;rence UTF-8.</li>
    <li>La premi&egrave;re ligne de votre fichier doit comporter un <b>en-t&ecirc;te</b> comportant le nom des colonnes.</li></ul></p>
    <h3>Utilisation</h3>
    <ul>
      <li>Cliquez sur <tt>Parcourir</tt> pour s&eacute;lectionner le fichier &agrave; importer.</li>
      <li>Apr&egrave;s avoir cliqu&eacute; sur <tt>Suivant</tt>, configurez votre import en param&eacute;trant les correspondances de champ. S'il n'existe pas de correspondance entre certaines colonnes de votre tableur et celles propos&eacute;es, laissez sur [Aucune].</li>
      <li>Cliquez &agrave; nouveau sur <tt>Suivant</tt> pour pr&eacute;visualiser les donn&eacute;es sur le point d'&ecirc;tre import&eacute;es.</li>
      <li>Cliquez sur <tt>Validation</tt> pour lancer l'importation.</li>
    </ul>
    <h3>Remarques</h3>
    <ul>
      <li>L'id d'un contact dans Algem correspond &agrave; son num&eacute;ro en base de donn&eacute;es. <b>Ce champ ne doit &ecirc;tre utilis&eacute; que si votre base comporte des contacts d&eacute;j&agrave; pr&eacute;sents dans Algem</b>.</li>
      <li>Le nom et le pr&eacute;nom du parent, s'ils sont pr&eacute;sents, seront utilis&eacute;s pour relier un enfant &agrave; son payeur (responsable).</li>
      <li>Les doublons (m&ecirc;mes nom et pr&eacute;nom) ne sont pas pris en compte.</li>
    </ul>
  </body>
</html>
